{
  "title": "What is CityBlocs?",
  "desc": [
    "City councils are incredibly important institutions. They deal most closely with issues that affect us every day, such as transportation, neighbourhood design and garbage collection. Despite this centrality to our daily lives, public interest is usually much lower for local politics than it is for federal or provincial politics. At the same time, paying attention to federal or provincial politics is often easier. If you want to know what's going on and who to cheer for, you usually only need to figure out which parties supported which pieces of legislation to get a sense of who to support. This is because parties almost exclusively vote as a cohesive voting bloc, or coalition, with very few members ever defying their party.",
    "Local politics takes more effort since most cities don't have political parties at all. Occasionally a single councillor will make headlines, often because of a particularly contentious issue, or even a scandal. Most of the time blocs arise naturally, continually shifting and reforming. Even in cities that do have parties (like Vancouver and Montreal), the parties change a lot more frequently than they do at other levels of government.",
    "This is where CityBlocs comes in. By analyzing the voting records of council members over the tenure of the council, we see patterns emerge, through the elements of a so-called dissimilarity matrix. Tables of numbers tend not to be as effective at communicating their content as dynamic visualizations though. We pretend that each councillor is a particle, naturally repelled from all the others. When we determine that a pair of councillors tend to vote together, we connect them with a spring. This brings the pair naturally closer together. Repeating this for every pair of councillors, we generate a &ldquo;map&rdquo; of the city councillors, showing which groups of councillors tend to vote together. In other words, we can visualize city blocs.",
    "When deciding whether two councillors should be linked, we use an 85%-agreement cut-off in most cases, and only include non-unanimous votes in our analysis. While this cut-off may seem high, many votes are reasonably perfunctory and in no way contentious, so near-complete agreement is not uncommon. The interesting features arise from those votes on which a council is divided. Qualitatively speaking, we have found that this cut-off level consistently generates the most interesting visualizations across a variety of city councils. The notable exception in this case is provided by Calgary.",
    "To find out more about this project or its methods or results, please [contact us](#/contact)."
  ],
  "ack": [
    "We gratefully acknowledge the Cities of [Calgary](http://agendaminutes.calgary.ca/sirepub/meetresults.aspx), [Edmonton](https://data.edmonton.ca/browse?limitTo=datasets), [Hamilton](http://www.hamilton.ca/CityDepartments/CorporateServices/Clerks/AgendaMinutes/Council/2014/), [Toronto](http://app.toronto.ca/tmmis/decisionBodyProfile.do?function=doPrepare&decisionBodyId=261#Meeting-2014.CC50), and [Ottawa](http://app05.ottawa.ca/sirepub/agendaminutes/index_en.aspx), and la [Ville de Montr&eacute;al](http://donnees.ville.montreal.qc.ca/dataset/conseil-municipal-pv), for providing electronic access to the minutes or voting records of their City Council meetings.",
    "This site was designed and implemented using the [D3 Data-Driven Documents](http://d3js.org/) and [Bootstrap](http://getbootstrap.com/) libraries. We highly recommend them, though they in no way endorse or are aware of us."
  ],
  "legal": [
    "[![Creative Commons License](http://i.creativecommons.org/l/by-nc-sa/4.0/88x31.png)](http://creativecommons.org/licenses/by-nc-sa/4.0/)",
    "CityBlocs is licensed under a [Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License](http://creativecommons.org/licenses/by-nc-sa/4.0/). If you are interested in using these results in print, please contact us and we can provide you with alternative forms, including graphics with white backgrounds. We appreciate, but do not require, being notified of any works derived from the content on this site."
  ]
}
